# Brewfile — run `brew bundle` from the dotfiles directory
# https://github.com/Homebrew/homebrew-bundle

# Terminal & Shell
brew "tmux"
brew "zsh"

# Shell tools
brew "fzf"
brew "jq"
brew "tree"
brew "ripgrep"
brew "fd"
brew "bat"
brew "htop"
brew "watch"
brew "shellcheck"

# Languages & version managers
brew "pyenv"
brew "nvm"
brew "go"
brew "rustup"
brew "uv"

# Build dependencies (used by pyenv, zshrc LDFLAGS)
brew "openssl@3"
brew "xz"
brew "readline"
brew "sqlite"
brew "zlib"

# Git
brew "git"
brew "gh"
brew "git-delta"

# Applications
cask "ghostty"
cask "visual-studio-code"

# Fonts
cask "font-noto-nerd-font"
